;
; AE language file
; For version 0.6.10.420 and up.
; (c) 2007-2016 WKStudio and The Contributors.
; This software is free. Please see License for details.
;
; Feel free to translate this file. Please do not vandalise. ^_^
; Save copy as Your_Language_Name.lang and it will be used by AE in the next loading.
;
; AE support ANSI, Shift-JIS and UNICODE language files. UTF-8 is not supported.
;
; Current charset: Unicode | DEFAULT_CHARSET
;
; Language: English (International)
;
; This is the official translation. You can change it, if you don't like it.
;

[Lang]
;
; Application version (in order to disable the outdated translations)
;
AppVersion                       =0.6.a.420

;
; Language name
;
Name                             =English (Default)

;
; Font charset
;
;   0 = ANSI_CHARSET
;   1 = DEFAULT_CHARSET
;   2 = SYMBOL_CHARSET
;  77 = MAC_CHARSET
; 128 = SHIFTJIS_CHARSET
; 129 = HANGEUL_CHARSET
; 130 = JOHAB_CHARSET
; 134 = GB2312_CHARSET
; 136 = CHINESEBIG5_CHARSET
; 161 = GREEK_CHARSET
; 162 = TURKISH_CHARSET
; 177 = HEBREW_CHARSET
; 178 = ARABIC_CHARSET
; 186 = BALTIC_CHARSET
; 204 = RUSSIAN_CHARSET
; 222 = THAI_CHARSET
; 238 = EASTEUROPE_CHARSET
; 255 = OEM_CHARSET
;
Charset                          =0

;
; Please see
;
; http://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
;
; for proper locale ID
;
LCID                             =1033

;
; Language Flag :)
;
LangFlag                         =bitmaps/flag/gb.png

;//////////////////////////////////////
;// Translator info                  //
;//////////////////////////////////////
;
; Please preserve "http://" and "mailto:" prefixes (you can also set something like
; "ReadMe.txt" or even "command.com", they will work as well ;) ).
;
; Note: DON'T LEAVE THEM BLANK. Write "n/a" instead.
;
Translator                       =WinKiller Studio
TranslatorWWW                    =http://wks.arai-kibou.ru/
TranslatorEMail                  =mailto:winkillerstudio@gmail.com

;//////////////////////////////////////
;// Font face & size                 //
;//////////////////////////////////////
;
; Monotype fonts (such as Lucida Console & Courier) are recommended
;
; Default is Lucida Console & 7 pixels

FontFace                         =Tahoma
FixedFontFace                    =Lucida Console
FontSize                         =8

;//////////////////////////////////////
;// Main window controls             //
;//////////////////////////////////////

TS_Archiver                      =Archive Tool
TS_Audio                         =Audio Tool
TS_Image                         =Image Tool
TS_Script                        =Script Tool
TS_E17_SCR                       =E17 SCR Tool
TS_Data                          =Data Tool
TS_Options                       =Options
TS_Log                           =Console
TS_About                         =About...

L_Messageboard                   =Application messageboard
L_Mini_Log.Hint                  =Double-click to view console log...

;//////////////////////////////////////
;// Game archive tool                //
;//////////////////////////////////////

SB_OpenArchive                   =Open archive
SB_ExtractFile                   =Extract selected
SB_ExtractAll                    =Extract all files
SB_CreateArchive                 =Create archive
SB_CloseArchive                  =Close archive

M_Arc_Files                      =Create from files
M_Arc_Directory                  =Create from directory
M_Arc_List                       =Create from list

M_Arc_Extract                    =Extract selected
M_Arc_ExtractAll                 =Extract all files

M_Arc_RAW                        =RAW Mode

M_Arc_ExtRAW                     =Extract selected
M_Arc_ExtAllRAW                  =Extract all files

M_Arc_ListGen                    =Generate file order list

M_Arc_CreateArchive              =Create archive...

M_Arc_SubFiles                   =...from files
M_Arc_SubDirectory               =...from directory
M_Arc_SubList                    =...from list

M_Arc_Special                    =Special...

M_Arc_HTMLList                   =Generate HTML file list
M_Arc_HTMLListDir                =Generate HTML file list from directory

M_Arc_HTMLFormatList             =[Debug] Generate HTML-list of supported formats
M_Arc_FormatsWriteIntoConsole    =[Debug] Print supported formats list into console log

M_Arc_GetHashes                  =Calculate archive's CRC32 and MD5 hashes

M_Arc_HiddenDataCheck            =[Debug] Hidden data check

M_Arc_FragmentationCheck         =[Debug] Fragmentation check

M_Arc_View                       =View as...
M_Arc_Icons                      =Icons
M_Arc_Report                     =Report

M_Arc_Properties                 =Properties

L_Arc_StatusProcessing           =Processing:

;//////////////////////////////////////
;// Game archive tool subtabsheet 1  //
;//////////////////////////////////////

TS_ArchiveInterface              =Info && Preview

GB_ArchiveOutputFormat           =Output archive's format

CB_ArchiveFormatList.Hint        =Set the output archive format

GB_ArchiveInfo                   =Opened archive info

FileList_Column_0                =Name and path
FileList_Column_1                =Size
FileList_Column_2                =Compressed
FileList_Column_3                =Offset

L_FileNameTitle                  =File name:
L_ArchiveSizeTitle               =File size:
L_ArchiveFormatTitle             =Format:
L_RecordsCountTitle              =Records:

;GB_AdditionalArcInfo             =Additional archive info

;L_ArchiveHexTitle                =CRC32:
;L_ArchiveMD5Title                =MD5:

;//////////////////////////////////////
;// Game archive tool subtabsheet 2  //
;//////////////////////////////////////

TS_ArchiveSetup                  =Setup

GB_ArchiveSetup                  =Archive tool setup

TS_Arc_FileExtraction            =File extraction

GB_ArcFileOverwritingMode        =File overwriting mode
RB_ArcFileExtrOverwrite          =Overwrite existant
RB_ArcFileExtrRename             =Rename new file by adding index at the end
RB_ArcFileExtrSkip               =Skip for existant files
RB_ArcFileExtrAbort              =Abort extraction

GB_MassExtraction                =Mass file extraction

CB_CreateArchiveSubdirectory     =Extract files into subdirectory which contain archive's filename. Example: "archive.bin~"
CB_AutoFilelistGenerate          =Automatically export list of files

TS_Arc_Saving                    =Archive creation

GB_ArchiveAddingMethod           =Default adding files method
RB_Arc_Files                     =Get from files (2500 max)
RB_Arc_Directory                 =Get from directory
RB_Arc_List                      =Get from list

CB_AllowArchiveOverwrite         =Allow overwriting (prevents some stupid people from killing original archives)
CB_RecursiveDirMode              =Use recursive directory scanning mode (i.e. search for files in subdirectories && store pathes if possible)
CB_NameArchiveAfterDir           =Suggest archive filename from file source directory

TS_Arc_Loading                   =Archive loading

GB_ArchiveHiddenScan             =Hidden archive metadata scanning

CB_HiddenDataAutoscan            =Enable autoscan and recover on loading
CB_HiddenDataAutoscanAsk         =Ask for user's confirmation before performing the action

;This component has been removed. May return in the future
;CB_Do_CRC32                      =Get CRC32 and MD5 checksums on loading (uncheck this if loading takes too long)

TS_Arc_Interface                 =Interface

CB_ArchiveListHumanReadable      =Show human-readable file sizes instead of hexadecimal values

;//////////////////////////////////////
;// Game archive tool subtabsheet 3  //
;//////////////////////////////////////

TS_ArchiveFormats                =Formats

;//////////////////////////////////////
;// Audio tool                       //
;//////////////////////////////////////

SB_Audio_Open                    =Open audio file
SB_Audio_Encode                  =Convert file to...
SB_Audio_Batch                   =Batch conversion

GB_AudioStream_Setup             =Direct audio converter setup

L_AudioStreamConvSel             =Select the conversion chain you want to perform:
L_AudioStream_InputDir           =Input directory:
L_AudioStream_OutputDir          =Output directory:

;//////////////////////////////////////
;// Image tool                       //
;//////////////////////////////////////

SB_EDGE_Picture_Open             =Open picture file
SB_EDGE_Picture_Save             =Save picture...
SB_EDGE_Picture_SaveWOAlpha      =Save w/o alpha
SB_EDGE_Picture_SaveAlpha        =Save alpha
SB_Image_Batch                   =Batch conversion
SB_Image_GrapS                   =GrapS - RAW reader

;//////////////////////////////////////
;// Image tool subtabsheet 1         //
;//////////////////////////////////////

TS_EDGE                          =Info && Preview

GB_ImageOperations               =Operations

TB_EDGE_Flip                     =Flip
TB_EDGE_Flip.Hint                =Flip image
TB_EDGE_Negative                 =Negative
TB_EDGE_Negative.Hint            =Invert colours of current image
TB_EDGE_ColorSwap                =Colour swap
TB_EDGE_ColorSwap.Hint           =Swap colour channels via selected method...
TB_EDGE_Grayscale                =Grayscale
TB_EDGE_Grayscale.Hint           =Convert image to grayscale via selected method...
TB_EDGE_SubAlpha_Append          =Add sub-alpha
TB_EDGE_SubAlpha_Append.Hint     =Append sub-alpha from alpha space (4th colour channel)
TB_EDGE_SubAlpha_Extract         =Move sub-alpha
TB_EDGE_SubAlpha_Extract.Hint    =Move sub-alpha into alpha space (4th colour channel)
TB_EDGE_SubAlpha_Destroy         =Delete sub-alpha
TB_EDGE_SubAlpha_Destroy.Hint    =Delete sub-alpha from the current image
TB_EDGE_Alpha_Flip               =Flip alpha
TB_EDGE_Alpha_Flip.Hint          =Flip alpha channel image
TB_EDGE_NegativeAlpha            =Negative alpha
TB_EDGE_NegativeAlpha.Hint       =Invert colours of current image's alpha
TB_EDGE_Alpha_Append             =Import alpha
TB_EDGE_Alpha_Append.Hint        =Import alpha channel from grayscale image
TB_EDGE_Alpha_Extract            =Save alpha
TB_EDGE_Alpha_Extract.Hint       =Save alpha channel as grayscale image
TB_EDGE_Alpha_Destroy            =Delete alpha
TB_EDGE_Alpha_Destroy.Hint       =Delete alpha channel from the current image
TB_EDGE_Alpha_Generate           =Generate alpha
TB_EDGE_Alpha_Generate.Hint      =Generate grayscale alpha image by comparing two pictures

SM_EDGE_GS_ArithmeticMean        =Arithmetic mean
SM_EDGE_GS_Luma                  =Classic Luma
SM_EDGE_GS_HDR                   =HDR \ Luma (More natural)
SM_EDGE_GS_Red                   =Red channel only
SM_EDGE_GS_Green                 =Green channel only
SM_EDGE_GS_Blue                  =Blue channel only

M_EDGE_SUBAlpha_Append_Left      =Left
M_EDGE_SUBAlpha_Append_Right     =Right
M_EDGE_SUBAlpha_Extract_Left     =Left
M_EDGE_SUBAlpha_Extract_Right    =Right
M_EDGE_SUBAlpha_Destroy_Left     =Left
M_EDGE_SUBAlpha_Destroy_Right    =Right

GB_ImagePreview                  =Preview (double-click spawns the preview window)

L_Image_Original                 =Image:
L_Image_Alpha                    =Alpha:

GB_ImageInfo                     =Current file info
L_ImageFileNameTitle             =File name:
L_ImageSizeTitle                 =File size:
L_ImageFormatTitle               =Format:
L_ImageResolutionTitle           =Resolution:
GB_ImageFormat                   =Output format
GB_EDGE_Coordinate_Editor        =PRT Coordinate Editor
CB_PRT_Editor_Enable             =Allow editing

GB_PreviewColor                  =Preview background colour

;//////////////////////////////////////
;// Image tool subtabsheet 2         //
;//////////////////////////////////////

TS_EDGE_Setup                    =Setup

GB_ImageSetup                    =Image tool setup

; All
TS_EDGE_All                      =All

GB_EDGE_General                  =General
CB_ALL_ProcessAlpha              =Process alpha image data (enable alpha loading && saving)
CB_All_LoadSepAlpha              =Load alpha from supplied bmp files (i.e. "file.jpg + filea.bmp" combos)
CB_EDGE_InvertAlpha              =Handle SUBalpha as inverted image (varies from game to game)

GB_EDGE_ColorOptions             =Colour options

GB_EDGE_GrayScale                =Default grayscaling method
GB_EDGE_ColourSwap               =Default colour swapping method

; PNG & JPEG
GB_EDGE_PNG_JPEG                 =PNG && JPEG

CB_JPEGProgressive               =Save progressive JPEG files (useful for web pages)
L_JPEG_Quality                   =JPEG saving quality (1 - bad quality, 100 - big filesize):
B_EDGE_JPEG_Reset                =Reset
L_PNG_Compression                =PNG saving compression ratio (0 - no compression, 9 - maximum):
B_EDGE_PNG_Reset                 =Reset

; PRT
TS_EDGE_PRT                      =PRT

GB_EDGE_PRT                      =Kid Engine PRT

CB_PRT_Coords                    =Load and save PRT XY rendering coordinates as ini files along with image files

; Misc
TS_EDGE_Misc                     =Misc

GB_EDGE_Misc                     =Misc
SB_EDGE_JPHTML.Hint              =Generate HTML version of the Japanese Colour Palette Table

;//////////////////////////////////////
;// Script tool (work-in-progress)   //
;//////////////////////////////////////

SB_SR_Open                       =Open script file
SB_SR_Decompile                  =Save decompiled
SB_SR_BatchDecompile             =Batch decompile
SB_SR_Compile                    =Compile
SB_SR_BatchCompile               =Batch compile

CB_SR_ScriptFormat.Hint          =Sets the output script format

;//////////////////////////////////////////////////
;// Script tool (obsolete Ever17 Script Chunker) //
;//////////////////////////////////////////////////

SB_OpenSCR                       =Open scenario file
SB_ExportSCRChunks               =Export data chunks
SB_ImportSCRChunks               =Import data chunks
SB_SCRChunkEditor                =String editor
SB_SCRSaveText                   =Save text

L_SCRTextSections                =Decompiled text sections:

GB_SCRSetup                      =Setup
GB_SCRImport                     =Import

CB_SCRAutoimport                 =Automatically import on loading
CB_SCRSaveDir                    =Save copy into directory:

;L_SCR_12345=123456789012345678901234567890123456789012345678

GB_SC3                           =KID Engine SC3 Decompilation
RB_SC3_Strip                     =Decode and strip all opcodes (readable text)
RB_SC3_Keep                      =Decode and keed all opcodes (recompilation)
SB_CompileList                   =Compile from list
SB_CompileList.Hint              =Open text file with 'op00' style lines. Referenced to 'op00\op00.scr'...

GB_ScenarioFileInfo              =Scenario file info

L_ScenarioOffsetText             =Text chunks beginning offset:
L_ScenarioRecordsText            =Total text record definitions:

L_Warn_E17                       =Please note: this tool was created for Ever17 only and cannot handle any other script formats.

;//////////////////////////////////////
;// Data tool                        //
;//////////////////////////////////////

SB_Data_Open                     =Open file
SB_Data_Process                  =Process data
SB_Data_Bruteforce               =Bruteforce bytes
SB_Data_Batch                    =Batch processing
SB_Data_Close                    =Close file

GB_DataConv                      =Data converter options

L_DataConv_Mode                  =Mode selection:
L_DataConv_Parameter             =Parameter:

L_DataConv_KeyFile               =Key file:
B_DataConv_Keyfile               =...
B_DataConv_Keyfile.Hint          =Hit this to select any "key" file

GB_DataConv_Value                =Value

GB_Value                         =Value interpretation

GB_HexViewer                     =HEX Viewer

;//////////////////////////////////////
;// Options                          //
;//////////////////////////////////////

;Core and language
TS_PC_CoreLang                   =Core / Language

GB_Core                          =Core

CB_NoAutocenter                  =Remember application window screen position (x,y coordinates). Turn off auto-centering
CB_KeepWindowState               =Remember application window state (minimized, normal or maximized)
CB_NoDefaultSize                 =Remember application window proportions (width and height)

CB_ScreenSnap                    =Snap application window to screen borders at
L_ScreenSnapPixels               =pixels
CB_AlphaBlendEffect              =Enable alpha blending appearance of main window during the loading
CB_EnableDoubleBuffering         =Enable double buffering for GUI rendering (reduce flickering, may be incompatible with "Modern" Themes)
CB_MultipleInstances             =Allow multiple instances

GB_Language                      =Language
L_LangAuthor                     =Author:
L_LangWWW                        =WWW:
L_LangEMail                      =E-Mail:

L_SelectedLanguage               =Selected language file:

B_DumpTranslation                =[ Debug ] Dump translation

;Skins and colour schemes
TS_PC_SkinColour                 =Skin / Colour scheme

GB_SC_Appearance                 =Appearance

B_IntSkinReload                  =[ Debug ] Reload internal skin


;//////////////////////////////////////
;// Log aka console                  //
;//////////////////////////////////////
GB_MessageLog                    =Display and store to log

CB_LogS                          =Static messages
CB_LogM                          =Normal messages
CB_LogI                          =Information
CB_LogD                          =Debug messages
CB_LogW                          =Warnings
CB_LogE                          =Errors
CB_NoLog                         =Nothing (turn off)
CB_NoLog.Hint                    =Disable logging system (no error messages will be displayed at all)
CB_BeepOnError                   =Beep!
CB_BeepOnWarn                    =Beep!

L_Log_BGColor                    =Background colour
L_Log_SelColor                   =Selection colour

M_Log_ClbCpy                     =Copy to clipboard
M_Log_ClbCpyAll                  =Copy all to clipboard
M_Log_Save                       =Save console as...
M_Log_Clear                      =Clear console

;//////////////////////////////////////
;// About box                        //
;//////////////////////////////////////

L_UsersManual                    => User's Manual <
L_ThisSoftwareIsFree             =This software is free. Please see License for details.
L_UnsupportedOS                  =WARNING: Your operating system is UNSUPPORTED. Errors are likely to occur.

M_ShowCredits                    =Show credits
M_SaveAboutBox                   =Save bitmap

;//////////////////////////////////////
;// GrapS Tool                       //
;//////////////////////////////////////

M_Graps_File                     =File
M_Graps_OpenFile                 =Open...
M_Graps_SaveAsBMP                =Save as BMP...
M_Graps_Exit                     =Return to AE
M_Graps_Help                     =?

TS_Graps_FileMode                =File Mode

GB_Graps_Seek                    =Seek control
L_Graps_Offset                   =Enter beginning offset:
B_Graps_JumpUp                   =^ Size ^
B_Graps_JumpDown                 =v Size v
B_Graps_Reset                    =RESET
L_Graps_SeekStep                 =Seeking step (for << and >>):
L_Graps_FinalOffsetText          =Ending offset:

TS_Graps_ProcessList             =Process List Mode

CB_Graps_ProcessList             =Process list and seeking
B_Graps_ProcListRefresh          =REFRESH
L_Graps_ProcAddressStart         =Memory address (HEX):
L_Graps_ProcMemCpy               =Amount to copy (HEX):
B_Graps_MemAddrPaste             =Paste
B_Graps_MemCpyFromCalc           =Get
B_Graps_CopyProcMem              =Grab memory
; Automatically grab every [ 500 ] ms
CB_Graps_MemoryAutoCpy           =Automatically grab every...

GB_Graps_Image                   =Image properties
L_Graps_Width                    =Enter image width:
L_Graps_Height                   =Enter image height:
L_Graps_Bitdepth                 =Select bit resolution:
CB_Graps_Interleaved             =Interleaved image stream
L_Graps_CalcStrSizeHEX           =Calculated size (HEX):

CB_Graps_Stretch                 =Stretch for viewer
I_Graps_View.Hint                =Double-click to save...
Memo_Graps_HowTo1                =How to use:
Memo_Graps_HowTo2                =Open (or drag-n-drop) any file that (possibly) contain UNCOMPRESSED bitmap data (game or software memory dumps, for example).
Memo_Graps_HowTo3                =Next, use trackbars or enter desirable bitmap size and set bits per pixel resolution (be careful. You will get no image if the size is overruned).
Memo_Graps_HowTo4                =Use seeking controls to search the correct image offset.
Memo_Graps_HowTo5                =When you'll get what you want, double-click the view to save BMP file. ^_^
Memo_Graps_HowTo6                =P.S. You can also search directly in application's memory. ^_~

;//////////////////////////////////////
;// Archive/file info dialog         //
;//////////////////////////////////////
TS_Info_File                     =File

L_Arc_FileTypeText               =File type:
L_Arc_FileHealthText             =Health:
L_Arc_FilePathText               =File path:
L_Arc_FileSizeText               =File size:
L_Arc_FileSizeCText              =Compressed:
L_Arc_CompTypeText               =Compression:

TS_Info_Attributes               =Attributes

L_Arc_CreatedText                =Created:
L_Arc_ModifiedText               =Modified:
L_Arc_OpenedText                 =Opened:

L_Arc_Attrib                     =Attributes:

CB_Arc_ReadOnly                  =Read only
CB_Arc_Archive                   =Archive
CB_Arc_Hidden                    =Hidden
CB_Arc_Compressed                =Compressed
CB_Arc_System                    =System
CB_Arc_Encrypted                 =Encrypted
CB_Arc_Virtual                   =Virtual
CB_Arc_Deleted                   =Deleted

TS_Info_AdditionalFields         =Additional fields

TS_Info_Archive                  =Archive

L_Arc_EngineVersion              =Engine version:
L_Arc_FormatSupportStat          =Format status:
L_Arc_TotalRecords               =Records in archive:
L_Arc_PhysicalArcSize            =Physical archive size:
L_Arc_UncompressedFilesSize      =Uncompressed files size:
L_Arc_CalculatedFilesSize        =Calculated files size:
L_Arc_WastedSize                 =Wasted:
L_Arc_SavedSize                  =Saved:
L_Arc_MissingSize                =Missing:
L_Arc_CompRatio                  =Compression ratio:
L_Arc_FragRatio                  =Fragmentation ratio:
L_Arc_DamageRatio                =Possible damage ratio:

TS_Info_Hashes                   =Hashes

B_DoMD5                          =Calculate
B_DoCRC32                        =Calculate

;//////////////////////////////////////
;// Messageboxes                     //
;//////////////////////////////////////

;
; Fragmentation\Compression ratio dialog
;
0000=Information
0001=Archive
0002=Additional fields
0003=File
0004=Engine version
0005=Format status
0006=Records in archive
0007=Fragmentation check results
0008=Physical archive size
0009=Calculated files size
000A=Uncompressed files size
000B=Wasted
000C=Saved
000D=Fragmentation ratio
000E=Compression ratio
000F=Missing
0010=Possible damage ratio

;
; Values
;
0011=bytes
0012=bit
0013=Kb
0014=Mb
0015=Gb

0016=unknown format

0017=All files
0018=Reserved
0019=Version
001A=New directory
001B=Cannot create directory in the selected location.

;
; Messages
;
001C=Please refer to readme for details about this format.
001D=The current implementation of this format is buggy and is known to produce files broken or unrecognizable by the original engine.
001E=The current implementation of this format is read-only.
001F=The current implementation of this format is untested.
0020=This format is Dummy.

0021=Warning
0022=The format you've selected is not implemented yet. Because of that the output file will be blank. Sorry. :)
0023=PLEASE NOTE: This operation will overwrite the existant chunks.
0024=Do you REALLY want to continue?
0025=Do you wish to overwrite original file? If not, then separate ".converted" version will be writed.

0026=Left
0027=Right
0028=Top
0029=Bottom

002A=not a file

;
; %Filename% > %s% symbols. Filename will be truncated.
;
002B=symbols. Filename will be truncated.

002C=started at
002D=copied to
002E=opened successfully.
002F=created successfully.
0030=extracted successfully.
0031=added successfully.
0032=decoded successfully.

;
; %filename% imported as alpha.
;
0033=imported as alpha.

0034=Initializing...
0035=Extracting...
0036=Converting...
0037=Saving...
0038=Opening...
0039=Adding...
003A=Exporting...
003B=Importing...

;
; Raw reader tool subheader
;
003C=the RAW image reader tool

;
; W.I.M.E.D. Messages
;
0087=File already exists. Overwriting...
0088=File already exists. Renaming...
0089=File already exists. Skipping...
008a=File already exists. Extraction aborted.

003D=Calculating CRC32, please wait...
;See 007c for continuation

003E=Open the archive file first!
003F=Error while extracting
0040=Archive is broken or unsupported.
0041=The file entry is not valid and cannot be extracted.
0042=Unable to unpack
0043=Archive stream is closed.
0044=Archive stream is closed. Already!
0045=The archive is already exists and cannot be overwritten. Please use a different filename and\or location.

0046=Invalid directory specified!

0047=Creating output directory...
0048=Cannot create output directory!

;0049=The current implementation of this format is a hacked version of the original format and it's behavior has been designed for an specifical case, so it may produce broken or incorrect data, either on loading or saving.
0049=The current implementation needs to deliberately misinterpret the original format to work, and it's behaviour has been designed for a specific use case. It may produce broken or incorrect data both on loading or saving.

004A=Cannot open the file. Make sure it is not used by other applications.

004B=Reading audio file...
004C=Open the audio file first!

004D=Image was succesfully converted.
004E=Error while converting image.
004F=Open the image file first!

0050=This image doesn't contain alpha.
0051=The image proportions is not the power of 2 and cannot be splitted or merged.
0052=Cannot compare images with different proportions.
0053=Unsupported format or alpha width && height differs from image's.

0054=Done.
0055=Cancelled by user.
0056=Unexpected error.
0057=Error while reading PNG resources.

0058=Unsupported format.
0059=The format you've selected as output is not (yet) implemented.

005A=You are trying to decode/encode key file using the same file as target. This operation is not allowed.

;
; This format is tagged as "%format_status%". Do you still wish to continue?
;
005B=This format is tagged as
005C=Do you still wish to continue?

005D=No valid keyfile specified.

005E=This format is a variation of the base format with minor differences in structure. For this reason it is skipped during archive format detection and considered "write-only".

005F=Cannot find the file.

;
; Error while saving %filename%
;
0060=Error while saving

0061=Archive overwriting mode is active. Please be careful.
0062=Archive overwriting mode is deactivated.

0063=Converting file bytes. Please wait...
0064=File bytes converted.
0065=Error while trying to convert file bytes.

0066=Logging has been disabled. Bye, bye! :(
0067=Logging has been enabled. I have a lot of things to say! :)

;
; AE debugging log cleared at %system_time%
;
0068=AE debugging log cleared at

0069=This option is under construction.

006A=Decompiling records...
006B=Exporting finished.
006C=Importing finished.

006D=Cannot export -- no file is opened.
006E=Cannot import -- no file is opened.
006F=Cannot import -- some chunk files are missing!
0070=Cannot create output directory and write compiled file.

0071=Reinitialization completed.

0072=A hidden (probably deleted or garbage) data has been found in this archive.
0073=Do you wish it to be listed in the GUI, so you would be able to extract it?
0074=Note: the unknown data will be appended to the end of file list.
0075=No hidden data found in this archive.

; %n gap(s) found in this archive at the following offsets:
0076=gap(s) found in this archive at the following offsets

0077=End of report.

;
; File/archive format info dialog window messages
;
0078=(no data)
0079=Damaged
007a=Dead
007b=Seems OK
007c=Calculating MD5 digest, please wait...
007d=CRC32 hash confirmation
007e=MD5 digest confirmation
007f=This file is large, so the operation may take very long time. Are you sure you still want to continue?

; Directory dialog window
0080=Please select the correct directory:

; Field group #%n
0081=Field group

; Compression types
0082=RAW
0083=None / Other
0084=Unknown
0085=Generic LZSS

;Unknown file type
0086=Unknown


;//////////////////////////////////////
;// Credits section (easter egg-3)   //
;//////////////////////////////////////
;
; Please note: new basic formatting scheme
;
; &b - bold, &u - underline, &s - striked-out, && - processed to "&"
;
00F0=&b&uCredits
00F1=&bIdea && graphics
00F2=&bCore
00F3=&bContributors
00F4=&bLocalisation staff
00F5=&bIncluded components && misc reference stuff
00F6=&bSpecial thanks to...

00FB=Nepeta Leijon sprite by CountAile. Used with purrmission. :33

00FD=:33 < *the mighty cat beast pounces on her unsuspecting prey*

00FE=To be continued! :)

;//////////////////////////////////////
;// Documentation file               //
;//////////////////////////////////////
00FF=AE.chm

;
; The End
;
